# Featuring engineering

# Feature engineering =
 # Creating new columns
 # Transforming existing columns
 # Encoding categories
 # Making raw data useful for models

# 1. creating new cloumns

In [43]:
import pandas as pd

In [44]:
import numpy as np

In [45]:
import pandas as pd
import numpy as np

data = {
    "Name": ["Ali", "Sara", "John", "Riya", "Aman"],
    "Age": [22, 25, 23, 30, 29],
    "City": ["Delhi", "Mumbai", "Delhi", "Pune", "Mumbai"],
    "Salary": [50000, 60000, 52000, 80000, 75000],
    "Experience": [1, 3, 2, 7, 6]
}

In [46]:
df = pd.DataFrame(data)

In [47]:
df

   Name  Age    City  Salary  Experience
0   Ali   22   Delhi   50000           1
1  Sara   25  Mumbai   60000           3
2  John   23   Delhi   52000           2
3  Riya   30    Pune   80000           7
4  Aman   29  Mumbai   75000           6

## example: salary in lakhs

In [48]:
df["Salary_lakhs"]=df["Salary"]/100000

In [49]:
df

   Name  Age    City  Salary  Experience  Salary_lakhs
0   Ali   22   Delhi   50000           1          0.50
1  Sara   25  Mumbai   60000           3          0.60
2  John   23   Delhi   52000           2          0.52
3  Riya   30    Pune   80000           7          0.80
4  Aman   29  Mumbai   75000           6          0.75

## example: age after 5 years

In [50]:
df["Age_after_5yrs"]=df["Age"]+5

In [51]:
df

   Name  Age    City  Salary  Experience  Salary_lakhs  Age_after_5yrs
0   Ali   22   Delhi   50000           1          0.50              27
1  Sara   25  Mumbai   60000           3          0.60              30
2  John   23   Delhi   52000           2          0.52              28
3  Riya   30    Pune   80000           7          0.80              35
4  Aman   29  Mumbai   75000           6          0.75              34

# 2. mathematical operations

## Apply arithmetic operations directly on columns

##  Example: Salary per year of experience

In [52]:
df["Salary_per_exp"]=df["Salary"]/df["Experience"]

In [53]:
df

,Name,Age,City,Salary,Experience,Salary_lakhs,Age_after_5yrs,Salary_per_exp
0,Ali,22,Delhi,50000,1,0.50,27,50000.000000
1,Sara,25,Mumbai,60000,3,0.60,30,20000.000000
2,John,23,Delhi,52000,2,0.52,28,26000.000000
3,Riya,30,Pune,80000,7,0.80,35,11428.571429
4,Aman,29,Mumbai,75000,6,0.75,34,12500.000000

# 3. Conditional Columns

## Create binary / category features based on conditions.

## Two main ways:

## np.where() (FAST)
## apply() (flexible but slower)

## using np.where()

In [56]:
df["High_Salary"]=np.where(df["Salary"]>60000,1,0)

In [57]:
df

,Name,Age,City,Salary,Experience,Salary_lakhs,Age_after_5yrs,Salary_per_exp,High_Salary
0,Ali,22,Delhi,50000,1,0.50,27,50000.000000,0
1,Sara,25,Mumbai,60000,3,0.60,30,20000.000000,0
2,John,23,Delhi,52000,2,0.52,28,26000.000000,0
3,Riya,30,Pune,80000,7,0.80,35,11428.571429,1
4,Aman,29,Mumbai,75000,6,0.75,34,12500.000000,1

## Using apply()

In [62]:
df["Senior_level"]=df["Experience"].apply(lambda x: "Senior" if x >=5 else "junior")

In [63]:
df

,Name,Age,City,Salary,Experience,Salary_lakhs,Age_after_5yrs,Salary_per_exp,High_Salary,Senior_level
0,Ali,22,Delhi,50000,1,0.50,27,50000.000000,0,junior
1,Sara,25,Mumbai,60000,3,0.60,30,20000.000000,0,junior
2,John,23,Delhi,52000,2,0.52,28,26000.000000,0,junior
3,Riya,30,Pune,80000,7,0.80,35,11428.571429,1,Senior
4,Aman,29,Mumbai,75000,6,0.75,34,12500.000000,1,Senior

# 4. String Operations (str accessor)

## Used when columns contain text

## Lowercase names

In [64]:
df["Name_lower"] = df["Name"].str.lower()

In [65]:
df

,Name,Age,City,Salary,Experience,Salary_lakhs,Age_after_5yrs,Salary_per_exp,High_Salary,Senior_level,Name_lower
0,Ali,22,Delhi,50000,1,0.50,27,50000.000000,0,junior,ali
1,Sara,25,Mumbai,60000,3,0.60,30,20000.000000,0,junior,sara
2,John,23,Delhi,52000,2,0.52,28,26000.000000,0,junior,john
3,Riya,30,Pune,80000,7,0.80,35,11428.571429,1,Senior,riya
4,Aman,29,Mumbai,75000,6,0.75,34,12500.000000,1,Senior,aman

## City starts with D?

In [66]:
df["Starts_D"]=df["City"].str.startswith("D")

In [67]:
df

,Name,Age,City,Salary,Experience,Salary_lakhs,Age_after_5yrs,Salary_per_exp,High_Salary,Senior_level,Name_lower,Starts_D
0,Ali,22,Delhi,50000,1,0.50,27,50000.000000,0,junior,ali,True
1,Sara,25,Mumbai,60000,3,0.60,30,20000.000000,0,junior,sara,False
2,John,23,Delhi,52000,2,0.52,28,26000.000000,0,junior,john,True
3,Riya,30,Pune,80000,7,0.80,35,11428.571429,1,Senior,riya,False
4,Aman,29,Mumbai,75000,6,0.75,34,12500.000000,1,Senior,aman,False

## Replace text

In [68]:
df["City"]=df["City"].str.replace("Mumbai","Bombay")

In [69]:
df

,Name,Age,City,Salary,Experience,Salary_lakhs,Age_after_5yrs,Salary_per_exp,High_Salary,Senior_level,Name_lower,Starts_D
0,Ali,22,Delhi,50000,1,0.50,27,50000.000000,0,junior,ali,True
1,Sara,25,Bombay,60000,3,0.60,30,20000.000000,0,junior,sara,False
2,John,23,Delhi,52000,2,0.52,28,26000.000000,0,junior,john,True
3,Riya,30,Pune,80000,7,0.80,35,11428.571429,1,Senior,riya,False
4,Aman,29,Bombay,75000,6,0.75,34,12500.000000,1,Senior,aman,False

## Categorical Encoding

In [71]:
import pandas as pd

df1 = pd.DataFrame({
    "City": ["Delhi", "Mumbai", "Pune", "Delhi"],
    "Salary": [50000, 60000, 55000, 52000]
})

encoded = pd.get_dummies(df1, columns=["City"])
print(encoded)

   Salary  City_Delhi  City_Mumbai  City_Pune
0   50000        True        False      False
1   60000       False         True      False
2   55000       False        False       True
3   52000        True        False      False

## this topic is incomplete